gadefox/ch32v003dbg/src/reg.h
// WCH-specific debug interface config registers

#pragma once

#include <stdint.h>

#include "context.h"
#include "swio.h"

//==============================================================================
// Electronic Signature

#define UNIID1  (1 << 0)
#define UNIID2  (1 << 1)
#define UNIID3  (1 << 2)

void esig_dump(uint32_t mask);

//------------------------------------------------------------------------------
// Flash capacity register

#define ESIG_FLACAP  0x1FFFF7E0

inline uint16_t esig_get_flacap(void) {
  return ctx_get_mem_u32_aligned(ESIG_FLACAP); }

//------------------------------------------------------------------------------
// UID registers

#define ESIG_UNIID1  0x1FFFF7E8
#define ESIG_UNIID2  0x1FFFF7EC
#define ESIG_UNIID3  0x1FFFF7F0

inline uint32_t esig_get_uniid1(void) {
  return ctx_get_mem_u32_aligned(ESIG_UNIID1); }
inline uint32_t esig_get_uniid2(void) {
  return ctx_get_mem_u32_aligned(ESIG_UNIID2); }
inline uint32_t esig_get_uniid3(void) {
  return ctx_get_mem_u32_aligned(ESIG_UNIID3); }

//==============================================================================
// Flash registers (memory-mapped I/O)

//------------------------------------------------------------------------------
// Option bytes

#define FLASH_OPTB  0x1FFFF800

typedef union {
  uint32_t raw;
  struct {
    uint32_t RDPR        : 8;  //  8; Read protection control bit
    uint32_t nRDPR       : 8;  // 16
    uint32_t IWDGSW      : 1;  // 17; Independent Watchdog configuration
    uint32_t PAD0        : 1;  // 18
    uint32_t STANDYRST   : 1;  // 19; System reset control in Standby mode
    uint32_t RST_MODE    : 2;  // 21; PD7 alternate as external pin reset
    uint32_t START_MODE  : 1;  // 22; Power-on startup mode
    uint32_t PAD1        : 2;  // 24
    uint32_t nIWDGSW     : 1;  // 25
    uint32_t PAD2        : 1;  // 26
    uint32_t nSTANDYRST  : 1;  // 27
    uint32_t nRST_MODE   : 2;  // 29
    uint32_t nSTART_MODE : 1;  // 30
    uint32_t PAD3        : 2;  // 32
  } b;
} flash_optb;

void flash_optb_dump(flash_optb r);
inline bool flash_set_optb(uint32_t reg) {
  return ctx_set_mem_u32_aligned(FLASH_OPTB, reg); }

inline flash_optb flash_get_optb(void) {
  flash_optb optb;
  optb.raw = ctx_get_mem_u32_aligned(FLASH_OPTB);
  return optb;
}

//------------------------------------------------------------------------------

#define FLASH_UDATA  0x1FFFF804

typedef union {
  uint32_t raw;
  struct {
    uint32_t DATA0       : 8;  //  8
    uint32_t nDATA0      : 8;  // 16
    uint32_t DATA1       : 8;  // 24
    uint32_t nDATA1      : 8;  // 32
  } b;
} flash_udata;

void flash_udata_dump(flash_udata r);
inline bool flash_set_udata(uint32_t reg) {
  return ctx_set_mem_u32_aligned(FLASH_UDATA, reg); }

inline flash_udata flash_get_udata(void) {
  flash_udata udata;
  udata.raw = ctx_get_mem_u32_aligned(FLASH_UDATA);
  return udata;
}

//------------------------------------------------------------------------------

#define FLASH_WRPR  0x1FFFF808

typedef union {
  uint32_t raw;
  struct {
    uint32_t WRPR0       : 8;  //  8
    uint32_t nWRPR0      : 8;  // 16
    uint32_t WRPR1       : 8;  // 24
    uint32_t nWRPR1      : 8;  // 32
  } b;
} flash_wrpr;

void flash_wrpr_dump(flash_wrpr r);
inline bool flash_set_wrpr(uint32_t reg) {
  return ctx_set_mem_u32_aligned(FLASH_WRPR, reg); }

inline flash_wrpr flash_get_wrpr(void) {
  flash_wrpr wrpr;
  wrpr.raw = ctx_get_mem_u32_aligned(FLASH_WRPR);
  return wrpr;
}

//------------------------------------------------------------------------------
// Control register

#define FLASH_ACTLR  0x40022000

typedef union {
  uint32_t raw;
  struct {
    uint32_t LATENCY : 2;  //  2; SYSCLK<=24 MHz: 0x00; SYSCLK<-48 MHz: 0x01
    uint32_t PAD0    : 30; // 32
  } b;
} flash_actlr;

void flash_actlr_dump(flash_actlr r);
inline bool flash_set_actlr(uint32_t reg) {
  return ctx_set_mem_u32_aligned(FLASH_ACTLR, reg); }

  inline flash_actlr flash_get_actlr(void) {
  flash_actlr actlr;
  actlr.raw = ctx_get_mem_u32_aligned(FLASH_ACTLR);
  return actlr;
}

//------------------------------------------------------------------------------
// FPEC key register

#define FLASH_KEYR  0x40022004

inline bool flash_set_keyr(uint32_t reg) {
  return ctx_set_mem_u32_aligned(FLASH_KEYR, reg); }

//------------------------------------------------------------------------------
// OBKEY register

#define FLASH_OBKEYR  0x40022008

inline bool flash_set_obkeyr(uint32_t reg) {
  return ctx_set_mem_u32_aligned(FLASH_OBKEYR, reg); }

//------------------------------------------------------------------------------
// Status register

#define FLASH_STATR  0x4002200C

#define STATR_BUSY       (1 << 0)
#define STATR_WRPRTERR   (1 << 4)
#define STATR_EOP        (1 << 5)
#define STATR_MODE       (1 << 14)
#define STATR_BOOT_LOCK  (1 << 15)

typedef union {
  uint32_t raw;
  struct {
    uint32_t BUSY      : 1;  //  1; True if flash busy
    uint32_t PAD0      : 3;  //  4
    uint32_t WRPRTERR  : 1;  //  5; True if the flash was written while locked
    uint32_t EOP       : 1;  //  6; True if flash finished programming
    uint32_t PAD1      : 8;  // 14
    uint32_t MODE      : 1;  // 15; Something to do with boot area flash?
    uint32_t BOOT_LOCK : 1;  // 16; True if boot flash locked
    uint32_t PAD2      : 16; // 32
  } b;
} flash_statr;

void flash_statr_dump(flash_statr r);
inline bool flash_set_statr(uint32_t reg) {
  return ctx_set_mem_u32_aligned(FLASH_STATR, reg); }

inline flash_statr flash_get_statr(void) {
  flash_statr statr;
  statr.raw = ctx_get_mem_u32_aligned(FLASH_STATR);
  return statr;
}

//------------------------------------------------------------------------------
// Configuration register

#define FLASH_CTLR  0x40022010

#define CTLR_PG       (1 << 0)
#define CTLR_PER      (1 << 1)
#define CTLR_MER      (1 << 2)
#define CTLR_OBG      (1 << 4)
#define CTLR_OBER     (1 << 5)
#define CTLR_STRT     (1 << 6)
#define CTLR_LOCK     (1 << 7)
#define CTLR_OBWRE    (1 << 9)
#define CTLR_ERRIE    (1 << 10)
#define CTLR_EOPIE    (1 << 12)
#define CTLR_FLOCK    (1 << 15)
#define CTLR_FTPG     (1 << 16)
#define CTLR_FTER     (1 << 17)
#define CTLR_BUFLOAD  (1 << 18)
#define CTLR_BUFRST   (1 << 19)

