gadefox/ch32v003dbg/src/reg.h
typedef union {
  uint32_t raw;
  struct {
    uint32_t PG      : 1;  //  1; Program enable
    uint32_t PER     : 1;  //  2; Perform sector erase
    uint32_t MER     : 1;  //  3; Perform full erase
    uint32_t PAD0    : 1;  //  4;
    uint32_t OBG     : 1;  //  5; Perform user-selected word programming
    uint32_t OBER    : 1;  //  6; Perform user-selected word erasure
    uint32_t STRT    : 1;  //  7; Start
    uint32_t LOCK    : 1;  //  8; Flash lock status

    uint32_t PAD1    : 1;  //  9
    uint32_t OBWRE   : 1;  // 10; User-selected word write enable
    uint32_t ERRIE   : 1;  // 11; Error status interrupt control
    uint32_t PAD2    : 1;  // 12
    uint32_t EOPIE   : 1;  // 13; EOP interrupt control
    uint32_t PAD3    : 2;  // 15
    uint32_t FLOCK   : 1;  // 16; Fast programming mode lock

    uint32_t FTPG    : 1;  // 17; Fast page programming?
    uint32_t FTER    : 1;  // 18; Fast erase
    uint32_t BUFLOAD : 1;  // 19; Cache data into BUF
    uint32_t BUFRST  : 1;  // 20; BUF reset operation
    uint32_t PAD4    : 12; // 32;
  } b;
} flash_ctlr;

void flash_ctlr_dump(flash_ctlr r);
inline bool flash_set_ctlr(uint32_t reg) {
  return ctx_set_mem_u32_aligned(FLASH_CTLR, reg); }

inline flash_ctlr flash_get_ctlr(void) {
  flash_ctlr ctlr;
  ctlr.raw = ctx_get_mem_u32_aligned(FLASH_CTLR);
  return ctlr;
}

//------------------------------------------------------------------------------
// Address register

#define FLASH_ADDR  0x40022014

inline bool flash_set_addr(uint32_t reg) {
  return ctx_set_mem_u32_aligned(FLASH_ADDR, reg); }

//------------------------------------------------------------------------------
// Option byte register

#define FLASH_OBR  0x4002201C

typedef union {
  uint32_t raw;
  struct {
    uint32_t OBERR       : 1; //  1; Unlock OB error
    uint32_t RDPRT       : 1; //  2; Flash read protect flag
    uint32_t IWDG_SW     : 1; //  3; Independent watchdog enable
    uint32_t PAD0        : 1; //  4
    uint32_t STANDBY_RST : 1; //  5; System reset control in Standby mode
    uint32_t CFGRSTT     : 2; //  7; Configuration word reset delay time
    uint32_t PAD1        : 3; // 10
    uint32_t DATA0       : 8; // 18; Data byte 0
    uint32_t DATA1       : 8; // 26; Data byte 1
    uint32_t PAD2        : 6; // 32
  } b;
} flash_obr;

void flash_obr_dump(flash_obr r);

inline flash_obr flash_get_obr(void) {
  flash_obr obr;
  obr.raw = ctx_get_mem_u32_aligned(FLASH_OBR);
  return obr;
}

//------------------------------------------------------------------------------
// Write protection register

#define FLASH_WPR  0x40022020

inline uint32_t flash_get_wpr(void) {
  return ctx_get_mem_u32_aligned(FLASH_WPR); }

//------------------------------------------------------------------------------
// Extended key register

#define FLASH_MODEKEYR  0x40022024

inline bool flash_set_mode_keyr(uint32_t reg) {
  return ctx_set_mem_u32_aligned(FLASH_MODEKEYR, reg); }

//------------------------------------------------------------------------------
// Unlock BOOT key register

#define FLASH_BOOTKEYR  0x40022028

inline bool flash_set_boot_keyr(uint32_t reg) {
  return ctx_set_mem_u32_aligned(FLASH_BOOTKEYR, reg); }

//==============================================================================
// Debug module registers

void dm_print(uint8_t reg, uint32_t raw);
const char* dm_to_name(uint8_t reg);

//------------------------------------------------------------------------------
// Data registers, can be used for temporary storage of data

#define DM_DATA_ADDR   0xE0000000
#define DM_DATA0_ADDR  (DM_DATA_ADDR + 0xF4)
#define DM_DATA1_ADDR  (DM_DATA_ADDR + 0xF8)

#define DM_DATA0      0x04
#define DM_DATA1      0x05

inline uint32_t dm_get_data0(void) { return swio_get(DM_DATA0); }
inline void dm_set_data0(uint32_t d) { swio_put(DM_DATA0, d); }

inline uint32_t dm_get_data1(void) { return swio_get(DM_DATA1); }
inline void dm_set_data1(uint32_t d) { swio_put(DM_DATA1, d); }

//------------------------------------------------------------------------------
// Debug module control register

#define DM_CONTROL  0x10

#define DMCN_DMACTIVE         (1 << 0)
#define DMCN_NDMRESET         (1 << 1)
#define DMCN_CLRRESETHALTREQ  (1 << 2)
#define DMCN_SETRESETHALTREQ  (1 << 3)
#define DMCN_CLRKEEPALIVE     (1 << 4)
#define DMCN_SETKEEPALIVE     (1 << 5)
#define DMCN_HASEL            (1 << 26)
#define DMCN_ACKUNAVAIL       (1 << 27)
#define DMCN_ACKHAVERESET     (1 << 28)
#define DMCN_HARTRESET        (1 << 29)
#define DMCN_RESUMEREQ        (1 << 30)
#define DMCN_HALTREQ          (1 << 31)

typedef union {
  uint32_t raw;
  struct {
    uint32_t DMACTIVE        : 1;  //  1
    uint32_t NDMRESET        : 1;  //  2
    uint32_t CLRRESETHALTREQ : 1;  //  3
    uint32_t SETRESETHALTREQ : 1;  //  4
    uint32_t CLRKEEPALIVE    : 1;  //  5
    uint32_t SETKEEPALIVE    : 1;  //  6
    uint32_t HARTSELHI       : 10; // 16
    uint32_t HARTSELLO       : 10; // 26
    uint32_t HASEL           : 1;  // 27
    uint32_t ACKUNAVAIL      : 1;  // 28
    uint32_t ACKHAVERESET    : 1;  // 29
    uint32_t HARTRESET       : 1;  // 30
    uint32_t RESUMEREQ       : 1;  // 31
    uint32_t HALTREQ         : 1;  // 32
  } b;
} dm_control;

void dm_control_dump(dm_control r);
inline void dm_set_control(uint32_t reg) { swio_put(DM_CONTROL, reg); }

inline dm_control dm_get_control(void) {
  dm_control control;
  control.raw = swio_get(DM_CONTROL);
  return control;
}

//------------------------------------------------------------------------------
// Debug module status register

#define DM_STATUS  0x11

#define DMST_VERSION(n)     ((n) & 0xF)
#define DMST_AUTHENTICATED  (1 << 7)
#define DMST_ANYHALTED      (1 << 8)
#define DMST_ALLHALTED      (1 << 9)
#define DMST_ANYRUNNING     (1 << 10)
#define DMST_ALLRUNNING     (1 << 11)
#define DMST_ANYAVAIL       (1 << 12)
#define DMST_ALLAVAIL       (1 << 13)
#define DMST_ANYRESUMEACK   (1 << 16)
#define DMST_ALLRESUMEACK   (1 << 17)
#define DMST_ANYHAVERESET   (1 << 18)
#define DMST_ALLHAVERESET   (1 << 19)

