gadefox/ch32v003dbg/src/reg.h
typedef union {
  uint32_t raw;
  struct {
    uint32_t VERSION       : 4;  //  4
    uint32_t PAD0          : 3;  //  7
    uint32_t AUTHENTICATED : 1;  //  8
    uint32_t ANYHALTED     : 1;  //  9
    uint32_t ALLHALTED     : 1;  // 10
    uint32_t ANYRUNNING    : 1;  // 11
    uint32_t ALLRUNNING    : 1;  // 12
    uint32_t ANYAVAIL      : 1;  // 13
    uint32_t ALLAVAIL      : 1;  // 14
    uint32_t PAD1          : 2;  // 16
    uint32_t ANYRESUMEACK  : 1;  // 17
    uint32_t ALLRESUMEACK  : 1;  // 18
    uint32_t ANYHAVERESET  : 1;  // 19
    uint32_t ALLHAVERESET  : 1;  // 20
    uint32_t PAD2          : 12; // 32
  } b;
} dm_status;

void dm_status_dump(dm_status r);

inline dm_status dm_get_status(void) {
  dm_status status;
  status.raw = swio_get(DM_STATUS);
  return status;
}

//------------------------------------------------------------------------------
// Microprocessor status register

#define DM_HARTINFO  0x12

#define DMHI_DATAADDR(n)    ((n) & 0xFFF)
#define DMHI_DATASIZE(n)    (((n) & 0xF) << 12)
#define DMHI_DATAACCESS     (1 << 16)
#define DMHI_NSCRATCH(n)    (((n) & 0xF) << 20)


typedef union {
  uint32_t raw;
  struct {
    uint32_t DATAADDR   : 12; // 12
    uint32_t DATASIZE   : 4;  // 16
    uint32_t DATAACCESS : 1;  // 17
    uint32_t PAD0       : 3;  // 20
    uint32_t NSCRATCH   : 4;  // 24
    uint32_t PAD1       : 8;  // 32
  } b;
} dm_hartinfo;

void dm_hartinfo_dump(dm_hartinfo r);

inline dm_hartinfo dm_get_hartinfo(void) {
  dm_hartinfo hartinfo;
  hartinfo.raw = swio_get(DM_HARTINFO);
  return hartinfo;
}

//------------------------------------------------------------------------------
// Abstract command status register

#define DM_ABSTRACTCS  0x16

#define DMAB_CMDER_SUCCESS  0
#define DMAB_CMDER_ILC_ERR  1
#define DMAB_CMDER_CNS_ERR  2
#define DMAB_CMDER_EXC_ERR  3
#define DMAB_CMDER_HLT_ERR  4
#define DMAB_CMDER_BUS_ERR  5
#define DMAB_CMDER_PAR_ERR  6
#define DMAB_CMDER_OTH_ERR  7

typedef union {
  uint32_t raw;
  struct {
    uint32_t DATACOUNT   : 4;  //  4
    uint32_t PAD0        : 4;  //  8
    uint32_t CMDER       : 3;  // 11
    uint32_t PAD1        : 1;  // 12
    uint32_t BUSY        : 1;  // 13
    uint32_t PAD2        : 11; // 24
    uint32_t PROGBUFSIZE : 5;  // 29
    uint32_t PAD3        : 3;  // 32
  } b;
} dm_abstractcs;

void dm_abstractcs_dump(dm_abstractcs r);
inline void dm_set_abstractcs(uint32_t reg) { swio_put(DM_ABSTRACTCS, reg); }

inline dm_abstractcs dm_get_abstractcs(void) {
  dm_abstractcs abstractcs;
  abstractcs.raw = swio_get(DM_ABSTRACTCS);
  return abstractcs;
}

//------------------------------------------------------------------------------
// Abstract command register

#define DM_COMMAND  0x17

#define DMCM_REGNO_CSR(n)   ((n) & 0xFFF)
#define DMCM_REGNO_GPR(n)   (((n) & 0x1F) | 0x1000)

#define DMCM_WRITE          (1 << 16)
#define DMCM_TRANSFER       (1 << 17)
#define DMCM_POSTEXEC       (1 << 18)
#define DMCM_AARPOSTINC     (1 << 19)

#define DMCM_AARSIZE_8IT    (0 << 20)
#define DMCM_AARSIZE_16BIT  (1 << 20)
#define DMCM_AARSIZE_32BIT  (2 << 20)

typedef union {
  uint32_t raw;
  struct {
    uint32_t REGNO      : 16; // 16
    uint32_t WRITE      : 1;  // 17
    uint32_t TRANSFER   : 1;  // 18
    uint32_t POSTEXEC   : 1;  // 19
    uint32_t AARPOSTINC : 1;  // 20
    uint32_t AARSIZE    : 3;  // 23
    uint32_t PAD0       : 9;  // 32
  } b;
} dm_command;

void dm_command_dump(dm_command r);

inline dm_command dm_get_command(void) {
  dm_command command;
  command.raw = swio_get(DM_COMMAND);
  return command;
}

inline void dm_set_command(uint32_t reg) { swio_put(DM_COMMAND, reg); }

//------------------------------------------------------------------------------
// Abstract command auto-execution

#define DM_ABSTRACTAUTO  0x18

#define DMAA_AUTOEXECDATA(b)  ((b) & 0xFFF)
#define DMAA_AUTOEXECPROG(b)  (((b) & 0xFF) << 16)

typedef union {
  uint32_t raw;
  struct {
    uint32_t AUTOEXECDATA : 12; // 12
    uint32_t PAD0         : 4;  // 16
    uint32_t AUTOEXECPROG : 8;  // 24;  NOTE: V2 series design 8 progbuf, corresponding to bits [23:16]
    uint32_t PAD1         : 8;  // 32
  } b;
} dm_abstractauto;

void dm_abstractauto_dump(dm_abstractauto r);
inline void dm_set_abstractauto(uint32_t reg) { swio_put(DM_ABSTRACTAUTO, reg); }

inline dm_abstractauto dm_get_abstractauto(void) {
  dm_abstractauto abstractauto;
  abstractauto.raw = swio_get(DM_ABSTRACTAUTO);
  return abstractauto;
}

//------------------------------------------------------------------------------
// Instruction cache registers 0-7

#define DM_PROGBUF_MAX  8

#define DM_PROGBUF0  0x20
#define DM_PROGBUF1  0x21
#define DM_PROGBUF2  0x22
#define DM_PROGBUF3  0x23
#define DM_PROGBUF4  0x24
#define DM_PROGBUF5  0x25
#define DM_PROGBUF6  0x26
#define DM_PROGBUF7  0x27

void dm_progbuf_dump(void);
inline uint32_t dm_get_progbuf(uint8_t i) { return swio_get(DM_PROGBUF0 + i); }
inline void dm_set_progbuf(uint8_t i, uint32_t reg) { swio_put(DM_PROGBUF0 + i, reg); }

//------------------------------------------------------------------------------
// Halt status register

#define DM_HALTSUM0  0x40

inline uint32_t dm_get_haltsum0(void) { return swio_get(DM_HALTSUM0); }

//------------------------------------------------------------------------------
// Debug MCU Configuration Register
// FIXME: what was this for?

#define DM_DBGMCU_CR  0x7C0

typedef union {
  uint32_t raw;
  struct {
    uint32_t IWDG_STOP : 1;  //  1
    uint32_t WWDG_STOP : 1;  //  2
    uint32_t PAD0      : 2;  //  4
    uint32_t TIM1_STOP : 1;  //  5
    uint32_t TIM2_STOP : 1;  //  6
    uint32_t PAD1      : 26; // 32
  } b;
} dm_dbgmcu_cr;

//==============================================================================
// Debug-specific CSRs

//------------------------------------------------------------------------------
// Debug Control and Status Register

#define CSR_DCSR  0x7B0

#define DCSR_STEP           (1 << 2)
#define DCSR_NMIP           (1 << 3)
#define DCSR_MPRVEN         (1 << 4)

