gadefox/ch32v003dbg/src/reg.h
#define DCSR_CAUSE_EBREAK   (0 << 6)
#define DCSR_CAUSE_TRIGGER  (1 << 6)
#define DCSR_CAUSE_HALTREQ  (2 << 6)
#define DCSR_CAUSE_STEP     (3 << 6)
#define DCSR_CAUSE_RESET    (4 << 6)

#define DCSR_STOPTIME       (1 << 9)
#define DCSR_STOPCOUNT      (1 << 10)
#define DCSR_STEPIE         (1 << 11)
#define DCSR_EBREAKU        (1 << 12)
#define DCSR_EBREAKS        (1 << 13)
#define DCSR_EBREAKM        (1 << 15)

#define DCSR_XDEBUGVER(v)   (((v) & 0xF) << 28)

typedef union {
  uint32_t raw;
  struct {
    uint32_t PRV       : 2;  //  2
    uint32_t STEP      : 1;  //  3
    uint32_t NMIP      : 1;  //  4
    uint32_t MPRVEN    : 1;  //  5
    uint32_t PAD0      : 1;  //  6
    uint32_t CAUSE     : 3;  //  9
    uint32_t STOPTIME  : 1;  // 10
    uint32_t STOPCOUNT : 1;  // 11
    uint32_t STEPIE    : 1;  // 12
    uint32_t EBREAKU   : 1;  // 13
    uint32_t EBREAKS   : 1;  // 14
    uint32_t PAD1      : 1;  // 15
    uint32_t EBREAKM   : 1;  // 16
    uint32_t PAD3      : 12; // 28
    uint32_t XDEBUGVER : 4;  // 32
  } b;
} csr_dcsr;

void csr_dcsr_dump(csr_dcsr r);

inline csr_dcsr csr_get_dcsr(void) {
  csr_dcsr r;
  r.raw = ctx_get_csr(CSR_DCSR);
  return r;
}

inline void csr_set_dcsr(uint32_t reg) { ctx_set_csr(CSR_DCSR, reg); }

//------------------------------------------------------------------------------
// Debug Program Counter

#define CSR_DPC  0x7B1

inline uint32_t csr_get_dpc(void) { return ctx_get_csr(CSR_DPC); }
inline void csr_set_dpc(uint32_t r) { ctx_set_csr(CSR_DPC, r); }

//------------------------------------------------------------------------------
// Debug Scratch Registers
//
#define CSR_DSCRATCH0  0x7B2
#define CSR_DSCRATCH1  0x7B3

inline uint32_t csr_get_dscratch0(void) { return ctx_get_csr(CSR_DSCRATCH0); }
inline void csr_set_dscratch0(uint32_t r) { ctx_set_csr(CSR_DSCRATCH0, r); }

inline uint32_t csr_get_dscratch1(void) { return ctx_get_csr(CSR_DSCRATCH1); }
inline void csr_set_dscratch1(uint32_t r) { ctx_set_csr(CSR_DSCRATCH1, r); }

//==============================================================================
// Debug interface registers

//------------------------------------------------------------------------------
// Capability Register

#define DM_CPBR  0x7C

#define CPBR_TDIV(n)           ((n) & 3)
#define CPBR_SOPN(n)           (((n) & 3) << 4)
#define CPBR_CHECKSTA          (1 << 8)
#define CPBR_CMDEXTENSTA       (1 << 9)
#define CPBR_OUTSTA            (1 << 10)
#define CPBR_IOMODE(n)         (((n) & 3) << 11)
#define CPBR_VERSION(n)        (((n) & 0xFFFF) << 16)

typedef union {
  uint32_t raw;
  struct {
    uint32_t TDIV        : 2;  //  2; Clock division factor
    uint32_t PAD0        : 2;  //  4
    uint32_t SOPN        : 2;  //  6; Stop sign factor
    uint32_t PAD1        : 2;  //  8
    uint32_t CHECKSTA    : 1;  //  9; CRC8 checksum function
    uint32_t CMDEXTENSTA : 1;  // 10; Command code extension function
    uint32_t OUTSTA      : 1;  // 11; Output function status
    uint32_t IOMODE      : 2;  // 13; Debug I/O port support mode
    uint32_t PAD2        : 3;  // 16
    uint32_t VERSION     : 16; // 32; Version number
  } b;
} dm_cpbr;

void dm_cpbr_dump(dm_cpbr r);

inline dm_cpbr dm_get_cpbr(void) {
  dm_cpbr cpbr;
  cpbr.raw = swio_get(DM_CPBR);
  return cpbr;
}

//------------------------------------------------------------------------------
// Configuration Register
 
#define DM_CFGR  0x7D

#define DMCF_CHECKEN   (1 << 8)
#define DMCF_CMDEXTEN  (1 << 9)
#define DMCF_OUTEN     (1 << 10)
#define DMCF_KEY(b)    (((b) & 0xFFFF) << 16)

typedef union {
  uint32_t raw;
  struct {
    uint32_t TDIVCFG   : 2;  //  2; Clock division factor
    uint32_t PAD0      : 2;  //  4
    uint32_t SOPNCFG   : 2;  //  6; Stop sign factor
    uint32_t PAD1      : 2;  //  8
    uint32_t CHECKEN   : 1;  //  9; CRC8 checksum function
    uint32_t CMDEXTEN  : 1;  // 10; Command code extension function
    uint32_t OUTEN     : 1;  // 11; Output function status
    uint32_t IOMODECFG : 2;  // 13; Debug I/O port support mode
    uint32_t PAD2      : 3;  // 16
    uint32_t KEY       : 16; // 32; Key register
  } b;
} dm_cfgr;

void dm_cfgr_dump(dm_cfgr r);
inline void dm_set_cfgr(uint32_t reg) { swio_put(DM_CFGR, reg); }

inline dm_cfgr dm_get_cfgr(void) {
  dm_cfgr cfgr;
  cfgr.raw = swio_get(DM_CFGR);
  return cfgr;
}

//------------------------------------------------------------------------------
// Shadow Configuration Register

#define DM_SHDWCFGR  0x7E

#define DMSC_CHECKEN   (1 << 8)
#define DMSC_CMDEXTEN  (1 << 9)
#define DMSC_OUTEN     (1 << 10)
#define DMSC_KEY(b)    (((b) & 0xFFFF) << 16)

typedef union {
  uint32_t raw;
  struct {
    uint32_t TDIVCFG   : 2;  //  2; Clock division factor
    uint32_t PAD0      : 2;  //  4
    uint32_t SOPNCFG   : 2;  //  6; Stop sign factor
    uint32_t PAD1      : 2;  //  8
    uint32_t CHECKEN   : 1;  //  9; CRC8 checksum function
    uint32_t CMDEXTEN  : 1;  // 10; Command code extension function
    uint32_t OUTEN     : 1;  // 11; Output function status
    uint32_t IOMODECFG : 2;  // 13; Debug I/O port support mode
    uint32_t PAD2      : 3;  // 16
    uint32_t KEY       : 16; // 32; Key register
  } b;
} dm_shdwcfgr;

void dm_shdwcfgr_dump(dm_shdwcfgr r);
inline void dm_set_shdwcfgr(uint32_t reg) { swio_put(DM_SHDWCFGR, reg); }

inline dm_shdwcfgr dm_get_shdwcfgr(void) {
  dm_shdwcfgr shwdcfgr;
  shwdcfgr.raw = swio_get(DM_SHDWCFGR);
  return shwdcfgr;
}

//------------------------------------------------------------------------------
// NOTE: not in doc but appears to be part info

#define DM_PART  0x7F

inline uint32_t dm_get_part(void) { return swio_get(DM_PART); }

//==============================================================================
// General-Purpose Register

#define GPR_ZERO  0   //  x0; hardwired zero
#define GPR_RA    1   //  x1; return address
#define GPR_SP    2   //  x2; stack pointer
#define GPR_GP    3   //  x3; global pointer
#define GPR_TP    4   //  x4; thread pointer
#define GPR_T0    5   //  x5; thread pointer
#define GPR_T1    6   //  x6; thread pointer
#define GPR_T2    7   //  x7; thread pointer
#define GPR_S0    8   //  x8; saved / frame pointer
#define GPR_S1    9   //  x9; saved / frame pointer
#define GPR_A0    10  // x10; function parameter / return
#define GPR_A1    11  // x11; function parameter / return
#define GPR_A2    12  // x12; function parameter
#define GPR_A3    13  // x13; function parameter
#define GPR_A4    14  // x14; function parameter
#define GPR_A5    15  // x15; function parameter
#define GPR_MAX   16

// GPR bitmasks
#define GPRB_ZERO  (1 << GPR_ZERO)
#define GPRB_RA    (1 << GPR_RA)
#define GPRB_SP    (1 << GPR_SP)
#define GPRB_GP    (1 << GPR_GP)
#define GPRB_TP    (1 << GPR_TP)
#define GPRB_T0    (1 << GPR_T0)
#define GPRB_T1    (1 << GPR_T1)
#define GPRB_T2    (1 << GPR_T2)
#define GPRB_S0    (1 << GPR_S0)
#define GPRB_S1    (1 << GPR_S1)
#define GPRB_A0    (1 << GPR_A0)
#define GPRB_A1    (1 << GPR_A1)
#define GPRB_A2    (1 << GPR_A2)
#define GPRB_A3    (1 << GPR_A3)
#define GPRB_A4    (1 << GPR_A4)
#define GPRB_A5    (1 << GPR_A5)

inline uint32_t gpr_get_a0(void) { return ctx_get_gpr(GPR_A0); }
inline void gpr_set_a0(uint32_t reg) { ctx_set_gpr(GPR_A0, reg); }

inline uint32_t gpr_get_a1(void) { return ctx_get_gpr(GPR_A1); }
inline void gpr_set_a1(uint32_t reg) { ctx_set_gpr(GPR_A1, reg); }

inline uint32_t gpr_get_a2(void) { return ctx_get_gpr(GPR_A2); }
inline void gpr_set_a2(uint32_t reg) { ctx_set_gpr(GPR_A2, reg); }

inline uint32_t gpr_get_a3(void) { return ctx_get_gpr(GPR_A3); }
inline void gpr_set_a3(uint32_t reg) { ctx_set_gpr(GPR_A3, reg); }

inline uint32_t gpr_get_a4(void) { return ctx_get_gpr(GPR_A4); }
inline void gpr_set_a4(uint32_t reg) { ctx_set_gpr(GPR_A4, reg); }

inline uint32_t gpr_get_a5(void) { return ctx_get_gpr(GPR_A5); }
inline void gpr_set_a5(uint32_t reg) { ctx_set_gpr(GPR_A5, reg); }

//------------------------------------------------------------------------------
